export const ACCESSORY_CONFIG = {
  edit: {
    symbol: "✎",
    accessibilityLabel: "Изменить",
  },
  navigate: {
    symbol: "▷",
    accessibilityLabel: "Открыть",
  },
};
export const DEVICE_PROPERTY_LABELS = {
  alarm: "Тревога",
  cleaning: "Уборка",
  switch: "Переключатель",
  use_time: "Время уборки",
  journal: "Журнал",
  sensors: "Сенсоры",
};

export const ERROR_LABELS = {
  AbortError: "Превышено время ожидания ответа.",
  FetchError: "Ошибка получения данных, попробуйте ещё раз.",
  InternalError: "Проверьте доступ к API Yandex.",
  NetworkError: "Ошибка сети, проверьте подключение с сети Интернет.",
  NotFound: "Запрашиваемый ресурс не найден.",
  Unauthorized: "Ошибка авторизации, проверьте ключ доступа.",
  ValidationError: "Ошибка авторизации, проверьте ключ доступа.",
};

export const SENSOR_EMPTY_VALUE = "@~~;";

export const TUYA_ERRORS = {
  errorCode_500: {
    ErrorCode: 500,
    ErrorMessage: "Системная ошибка, пожалуйста, свяжитесь с администратором",
    Description:
      "Сеть бизнес-приложения недоступна или истекло время ожидания API.",
    Solution:
      "Повторите попытку позже. Если проблема повторится, отправьте тикет в службу поддержки.",
  },
  errorCode_1000: {
    ErrorCode: 1000,
    ErrorMessage: "Данные не существуют",
    Description: "Данные не существуют.",
    Solution: "Проверьте параметры запроса.",
  },
  errorCode_1001: {
    ErrorCode: 1001,
    ErrorMessage: "Недействительный секретный ключ (secret)",
    Description: "Секретный ключ (secret) недействителен.",
    Solution:
      "Перейдите в раздел «Просмотр сведений о проекте» и проверьте значение secret.",
  },
  errorCode_1002: {
    ErrorCode: 1002,
    ErrorMessage: "access_token отсутствует",
    Description: "Токен пуст.",
    Solution:
      "Проверьте, не пуст ли access_token. Подробности см. в разделе «Параметры заголовка запроса».",
  },
  errorCode_1003: {
    ErrorCode: 1003,
    ErrorMessage: "Недопустимый тип авторизации (grant type)",
    Description: "Тип авторизации недействителен.",
    Solution:
      "Установите допустимый тип авторизации. Подробности см. в разделе «Получение токена».",
  },
  errorCode_1004: {
    ErrorCode: 1004,
    ErrorMessage: "Недействительная подпись (sign)",
    Description: "Подпись недействительна.",
    Solution:
      "Проверьте используемый алгоритм подписи. Подробности см. в разделе «Подписание запросов».",
  },
  errorCode_1005: {
    ErrorCode: 1005,
    ErrorMessage: "Недействительный clientId",
    Description: "Идентификатор client_id недействителен.",
    Solution:
      "Перейдите в раздел «Просмотр сведений о проекте» и проверьте значение client_id.",
  },
  errorCode_1010: {
    ErrorCode: 1010,
    ErrorMessage: "Срок действия токена истек",
    Description: "Срок действия токена истек.",
    Solution:
      "Проверьте период действия токена доступа. Подробности см. в разделе «Получение токена».",
  },
  errorCode_1011: {
    ErrorCode: 1011,
    ErrorMessage: "Токен недействителен",
    Description: "Токен недействителен.",
    Solution:
      "Проверьте валидность токена доступа. Подробности см. в разделе «Получение токена».",
  },
  errorCode_1012: {
    ErrorCode: 1012,
    ErrorMessage: "Статус токена недействителен",
    Description: "Статус токена недействителен.",
    Solution:
      "Проверьте статус токена доступа. Подробности см. в разделе «Получение токена».",
  },
  errorCode_1013: {
    ErrorCode: 1013,
    ErrorMessage: "Время запроса недействительно",
    Description: "Срок действия временной метки (timestamp) запроса истек.",
    Solution:
      "Проверьте, не истек ли срок действия временной метки запроса и не отличается ли она существенно от текущего времени. Подробности см. в разделе «Параметры заголовка запроса».",
  },
  errorCode_1100: {
    ErrorCode: 1100,
    ErrorMessage: "Параметр пуст",
    Description: "Некоторые параметры не заполнены.",
    Solution:
      "Проверьте, не отсутствует ли параметр или не задан ли он, на основе параметров запроса в документации API.",
  },
  errorCode_1101: {
    ErrorCode: 1101,
    ErrorMessage: "Недопустимый диапазон параметров",
    Description: "Диапазон параметров недействителен.",
    Solution:
      "Установите допустимый тип параметра и диапазон значений на основе параметров запроса в документации API.",
  },
  errorCode_1102: {
    ErrorCode: 1102,
    ErrorMessage: "Параметр равен null",
    Description: "Параметр пуст.",
    Solution:
      "Проверьте, не отсутствует ли параметр или не задан ли он, на основе параметров запроса в документации API.",
  },
  errorCode_1103: {
    ErrorCode: 1103,
    ErrorMessage: "Ошибка отправки команд",
    Description: "Указанная команда недействительна.",
    Solution:
      "Не удалось отправить команду. Проверьте соответствующее сообщение или повторите попытку позже.",
  },
  errorCode_1104: {
    ErrorCode: 1104,
    ErrorMessage: "Некорректный тип",
    Description: "Тип недействителен.",
    Solution: "Проверьте значение параметра type.",
  },
  errorCode_1105: {
    ErrorCode: 1105,
    ErrorMessage: "Отсутствует заголовок",
    Description: "Заголовок сформирован неверно.",
    Solution:
      "Проверьте, не отсутствует ли параметр в заголовке или не задан ли он неправильно. Подробности см. в разделе «Параметры заголовка запроса».",
  },
  errorCode_1106: {
    ErrorCode: 1106,
    ErrorMessage: "Доступ запрещен",
    Description:
      "Нет прав. Вы не авторизованы для доступа к API или устройству.",
    Solution:
      "Найдите подробную информацию об ошибке по идентификатору TID в логах API или проверьте, было ли привязано устройство.",
  },
  errorCode_1107: {
    ErrorCode: 1107,
    ErrorMessage: "Код авторизации недействителен",
    Description: "Код авторизации недействителен.",
    Solution: "Проверьте код авторизации.",
  },
  errorCode_1108: {
    ErrorCode: 1108,
    ErrorMessage: "Путь URI недействителен",
    Description: "Значение uri недействительно.",
    Solution: "Проверьте значение uri.",
  },
  errorCode_1109: {
    ErrorCode: 1109,
    ErrorMessage: "Недопустимый параметр, пожалуйста, проверьте его",
    Description: "Параметр недействителен.",
    Solution:
      "Установите допустимый тип параметра и диапазон значений на основе параметров запроса в документации API.",
  },
  errorCode_1110: {
    ErrorCode: 1110,
    ErrorMessage: "Превышен лимит одновременных запросов",
    Description: "Истекло время ожидания запроса.",
    Solution:
      "Повторите попытку позже. Если проблема повторится, отправьте тикет в службу поддержки.",
  },
  errorCode_1111: {
    ErrorCode: 1111,
    ErrorMessage: "Система занята, пожалуйста, повторите попытку позже",
    Description: "Система занята.",
    Solution:
      "Повторите попытку позже. Если проблема повторится, отправьте тикет в службу поддержки.",
  },
  errorCode_1112: {
    ErrorCode: 1112,
    ErrorMessage:
      "Пользователь синхронизируется в фоновом режиме, пожалуйста, повторите попытку позже",
    Description: "Данные пользователя синхронизируются.",
    Solution:
      "Данные пользователя синхронизируются в фоновом режиме. Повторите попытку позже.",
  },
  errorCode_1113: {
    ErrorCode: 1113,
    ErrorMessage: "Не повторяйте операцию в течение короткого времени",
    Description: "Повторный запрос.",
    Solution:
      "Повторите попытку позже. Подробности см. в разделе «Параметры заголовка запроса».",
  },
  errorCode_1114: {
    ErrorCode: 1114,
    ErrorMessage: "Ваш IP-адрес не имеет доступа к этому API",
    Description:
      "Для client_id включен белый список IP-адресов облачной авторизации, а IP-адрес запроса отсутствует в этом списке.",
    Solution:
      "Проверьте настройки белого списка. Подробности см. в разделе «Управление проектами».",
  },
  errorCode_1199: {
    ErrorCode: 1199,
    ErrorMessage: "Ваши запросы слишком частые",
    Description: "Слишком много запросов за короткий промежуток времени.",
    Solution: "Повторите попытку позже.",
  },
  errorCode_1400: {
    ErrorCode: 1400,
    ErrorMessage: "Токен недействителен",
    Description: "Токен недействителен.",
    Solution:
      "Проверьте валидность токена доступа. Подробности см. в разделе «Получение токена».",
  },
  errorCode_2007: {
    ErrorCode: 2007,
    ErrorMessage: "Межрегиональный IP-адрес",
    Description:
      "IP-адрес запроса принадлежит другому дата-центру. Доступ запрещен.",
    Solution:
      "IP-адрес может обращаться только к своему выделенному дата-центру. Чтобы разрешить доступ к другому дата-центру, настройте белый список IP-адресов облачной авторизации.",
  },
  errorCode_28841001: {
    ErrorCode: 28841001,
    ErrorMessage: "Нет прав",
    Description: "План облачной разработки не оформлен (нет подписки).",
    Solution:
      "Чтобы продолжить использование облачного сервиса, подпишитесь на план облачной разработки.",
  },
  errorCode_28841002: {
    ErrorCode: 28841002,
    ErrorMessage: "Срок действия плана облачной разработки истек",
    Description: "Срок вашей подписки на план облачной разработки истек.",
    Solution: "Продлите свой план или подпишитесь на облачный сервис заново.",
  },
  errorCode_28841003: {
    ErrorCode: 28841003,
    ErrorMessage: "Счет за план просрочен",
    Description: "Счет за вашу подписку просрочен.",
    Solution: "Оплатите счет и проверьте расходы.",
  },
  errorCode_28841004: {
    ErrorCode: 28841004,
    ErrorMessage: "Квота пробной версии исчерпана",
    Description: "Вы превысили квоту пробной версии (Trial Edition).",
    Solution:
      "Чтобы продолжить использование облачного сервиса, подпишитесь на план облачной разработки или дождитесь обновления квоты.",
  },
  errorCode_28841101: {
    ErrorCode: 28841101,
    ErrorMessage: "Нет подписки на API",
    Description: "Вы не подписаны на этот API.",
    Solution: "Подпишитесь на пакет ресурсов (resource pack) для этого API.",
  },
  errorCode_28841102: {
    ErrorCode: 28841102,
    ErrorMessage: "Подписка на API истекла",
    Description: "Срок вашей подписки на этот API истек.",
    Solution: "Продлите или подпишитесь на пакет ресурсов для этого API.",
  },
  errorCode_28841103: {
    ErrorCode: 28841103,
    ErrorMessage: "Счет за API просрочен",
    Description: "У вас есть просроченный счет за этот API.",
    Solution: "Оплатите счет и проверьте расходы.",
  },
  errorCode_28841104: {
    ErrorCode: 28841104,
    ErrorMessage: "Квота API исчерпана",
    Description: "Количество вызовов этого API превысило квоту.",
    Solution:
      "Чтобы продолжить использование облачного сервиса, улучшите пакет ресурсов для этого API или дождитесь обновления квоты.",
  },
  errorCode_28841105: {
    ErrorCode: 28841105,
    ErrorMessage: "Проект не авторизован для использования этого API",
    Description: "Указанный облачный проект не имеет прав на вызов этого API.",
    Solution:
      "Авторизуйте проект для использования этого API или измените настройки проекта.",
  },
  errorCode_28841106: {
    ErrorCode: 28841106,
    ErrorMessage: "Нет подписки на API",
    Description: "Вы не подписаны на этот API.",
    Solution: "Подпишитесь на пакет ресурсов для этого API.",
  },
  errorCode_2001: {
    ErrorCode: 2001,
    ErrorMessage: "Устройство не в сети",
    Description: "Устройство находится в автономном режиме (офлайн).",
    Solution: "Проверьте сетевое подключение устройства.",
  },
  errorCode_2002: {
    ErrorCode: 2002,
    ErrorMessage: "У этого пользователя нет устройств",
    Description: "У пользователя нет устройств.",
    Solution:
      "Проверить, привязана ли учетная запись пользователя к устройству.",
  },
  errorCode_2003: {
    ErrorCode: 2003,
    ErrorMessage: "Функция не поддерживается",
    Description: "Функция не поддерживается.",
    Solution:
      "Установите допустимую команду (инструкцию) на основе параметров запроса в документации API.",
  },
  errorCode_2004: {
    ErrorCode: 2004,
    ErrorMessage: "Тип замка не поддерживается",
    Description: "Тип замка не поддерживается.",
    Solution:
      "Установите допустимый тип замка на основе параметров запроса в документации API.",
  },
  errorCode_2005: {
    ErrorCode: 2005,
    ErrorMessage: "Продукт не существует",
    Description: "Продукт не существует.",
    Solution:
      "Проверьте, не отсутствует ли параметр продукта или не задан ли он неправильно.",
  },
  errorCode_2006: {
    ErrorCode: 2006,
    ErrorMessage: "Пользователь не существует",
    Description: "Пользователь не существует.",
    Solution:
      "Проверьте, не отсутствует ли параметр пользователя или не задан ли он неправильно.",
  },
  errorCode_2007: {
    ErrorCode: 2007,
    ErrorMessage: "Срок действия токена устройства исчез",
    Description: "Срок действия токена устройства истек.",
    Solution: "Проверьте период действия токена устройства.",
  },
  errorCode_2008: {
    ErrorCode: 2008,
    ErrorMessage: "Команда или значение не поддерживаются",
    Description: "Команда (инструкция) не поддерживается.",
    Solution:
      "Установите допустимую команду на основе параметров запроса в документации API.",
  },
  errorCode_2009: {
    ErrorCode: 2009,
    ErrorMessage: "Устройство не поддерживается",
    Description: "Устройство не поддерживается.",
    Solution:
      "Установите поддерживаемое устройство на основе параметров запроса в документации API.",
  },
  errorCode_2010: {
    ErrorCode: 2010,
    ErrorMessage: "Устройство не существует",
    Description: "Устройство не существует.",
    Solution:
      "Проверьте, не отсутствует ли параметр устройства или не задан ли он неправильно.",
  },
  errorCode_2012: {
    ErrorCode: 2012,
    ErrorMessage: "Приложение не поддерживается",
    Description: "Приложение не поддерживается.",
    Solution:
      "Установите поддерживаемое приложение на основе параметров запроса в документации API.",
  },
  errorCode_2013: {
    ErrorCode: 2013,
    ErrorMessage: "Не удалось добавить таймер",
    Description: "Не удалось добавить запланированную задачу.",
    Solution:
      "Проверьте значение параметра. Повторите попытку позже или обратитесь к администратору.",
  },
  errorCode_2014: {
    ErrorCode: 2014,
    ErrorMessage: "У этого устройства нет таймеров",
    Description: "У устройства нет запланированных задач.",
    Solution:
      "Проверьте, была ли создана запланированная задача для этого устройства.",
  },
  errorCode_2015: {
    ErrorCode: 2015,
    ErrorMessage: "Категория не поддерживается",
    Description: "Категория не поддерживается.",
    Solution:
      "Установите поддерживаемую категорию на основе параметров запроса в документации API.",
  },
  errorCode_2016: {
    ErrorCode: 2016,
    ErrorMessage: "Пульт дистанционного управления удален или не существует",
    Description: "Пульт дистанционного управления удален или не существует.",
    Solution:
      "Проверьте, доступна ли функция дистанционного управления или правильно ли значение параметра.",
  },
  errorCode_2017: {
    ErrorCode: 2017,
    ErrorMessage: "Схема не существует",
    Description: "Схема приложения не существует.",
    Solution:
      "Проверьте, существует ли схема приложения или правильно ли значение параметра.",
  },
  errorCode_2018: {
    ErrorCode: 2018,
    ErrorMessage: "Ошибка расшифровки данных",
    Description: "Не удалось расшифровать данные.",
    Solution:
      "Проверьте значение параметра. Повторите попытку позже или обратитесь к администратору.",
  },
  errorCode_2019: {
    ErrorCode: 2019,
    ErrorMessage: "Время превышает два часа",
    Description: "Временной интервал превышает два часа.",
    Solution:
      "Проверьте, не превышает ли временной интервал установленный лимит.",
  },
  errorCode_2020: {
    ErrorCode: 2020,
    ErrorMessage: "Поддерживаются только сторонние облачные сервисы",
    Description: "Поддерживаются только сторонние облачные сервисы.",
    Solution: "Проверьте, используется ли стороннее облако.",
  },
  errorCode_2021: {
    ErrorCode: 2021,
    ErrorMessage: "Недопустимый адрес электронной почты",
    Description: "Неверный адрес электронной почты.",
    Solution: "Проверьте формат адреса электронной почты.",
  },
  errorCode_2022: {
    ErrorCode: 2022,
    ErrorMessage: "Недопустимый номер телефона",
    Description: "Неверный номер мобильного телефона.",
    Solution: "Проверьте формат номера мобильного телефона.",
  },
  errorCode_2023: {
    ErrorCode: 2023,
    ErrorMessage: "Пользователь уже существует",
    Description: "Пользователь уже существует.",
    Solution: "Проверьте, была ли уже создана эта учетная запись пользователя.",
  },
  errorCode_2024: {
    ErrorCode: 2024,
    ErrorMessage: "Путь к файлу устройства не стандартизирован",
    Description: "Путь к файлу устройства недействителен.",
    Solution:
      "Проверьте формат пути к файлу устройства на основе параметров запроса в документации API.",
  },
  errorCode_2025: {
    ErrorCode: 2025,
    ErrorMessage: "Несоответствие устройства и пути к файлу",
    Description: "Устройство и путь к файлу не совпадают.",
    Solution: "Проверьте формат устройства и пути к файлу.",
  },
  errorCode_2026: {
    ErrorCode: 2026,
    ErrorMessage: "Не удалось получить IP-адрес",
    Description: "Не удалось получить IP-адрес.",
    Solution: "Проверьте, используется ли прокси-сервер.",
  },
  errorCode_2027: {
    ErrorCode: 2027,
    ErrorMessage: "Размер слишком велик",
    Description: "Размер слишком велик.",
    Solution: "Проверьте, не превышает ли текст или файл установленный лимит.",
  },
  errorCode_2028: {
    ErrorCode: 2028,
    ErrorMessage: "Срок действия токена шифрования истек",
    Description: "Срок действия токена истек.",
    Solution: "Проверьте период действия токена шифрования.",
  },
  errorCode_2029: {
    ErrorCode: 2029,
    ErrorMessage: "Статус сессии недействителен",
    Description: "Сессия недействительна.",
    Solution:
      "Проверьте, не истек ли срок действия сессии или правильно ли значение параметра.",
  },
  errorCode_2030: {
    ErrorCode: 2030,
    ErrorMessage: "Виртуальное сканирование поддерживает только регион AY",
    Description:
      "Виртуальное сканирование доступно только для дата-центра в Китае (регион AY).",
    Solution:
      "Проверьте, является ли запрашиваемая конечная точка (endpoint) дата-центром Китая.",
  },
  errorCode_2031: {
    ErrorCode: 2031,
    ErrorMessage: "Ошибка авторизации на сторонней платформе",
    Description: "Сбой сторонней аутентификации.",
    Solution:
      "Проверьте, исправно ли работает сторонний сервис. Повторите попытку позже или обратитесь к администратору.",
  },
  errorCode_2032: {
    ErrorCode: 2032,
    ErrorMessage: "Дубликат уникального ID запроса приложения",
    Description:
      "Идентификатор request_id уже существует. Требуется идемпотентность.",
    Solution:
      "Проверьте, правильно ли создается request_id, или не отправляются ли повторные запросы.",
  },
  errorCode_2033: {
    ErrorCode: 2033,
    ErrorMessage: "Более 1000 пользователей пуш-уведомлений",
    Description: "Слишком много получателей сообщений.",
    Solution:
      "Установите допустимое значение параметра на основе параметров запроса в документации API.",
  },
  errorCode_2037: {
    ErrorCode: 2037,
    ErrorMessage: "Имя пользователя привязано к другому типу",
    Description: "Пользователь привязан к другому типу.",
    Solution: "Проверьте, привязан ли пользователь к другим типам.",
  },
  errorCode_2041: {
    ErrorCode: 2041,
    ErrorMessage: "Имя оператора уже существует",
    Description: "Имя пользователя оператора уже существует.",
    Solution: "Проверьте, существует ли уже имя пользователя оператора.",
  },
  errorCode_2042: {
    ErrorCode: 2042,
    ErrorMessage: "Оператор не существует",
    Description: "Оператор не существует.",
    Solution:
      "Проверьте, существует ли оператор или правильно ли значение параметра.",
  },
  errorCode_2043: {
    ErrorCode: 2043,
    ErrorMessage: "UUID оператора не существует",
    Description: "UUID не существует.",
    Solution:
      "Проверьте, существует ли UUID или правильно ли значение его поля.",
  },
  errorCode_2044: {
    ErrorCode: 2044,
    ErrorMessage: "IP-адрес оператора не существует",
    Description: "IP-адрес не существует.",
    Solution:
      "Проверьте, существует ли IP-адрес или правильно ли его значение.",
  },
  errorCode_2045: {
    ErrorCode: 2045,
    ErrorMessage: "IP-адрес оператора уже привязан",
    Description: "IP-адрес оператора уже привязан.",
    Solution: "Проверьте, не привязан ли уже IP-адрес оператора.",
  },
  errorCode_2046: {
    ErrorCode: 2046,
    ErrorMessage: "UUID оператора уже привязан",
    Description: "UUID оператора уже привязан.",
    Solution: "Проверьте, не привязан ли уже UUID оператора.",
  },
  errorCode_2047: {
    ErrorCode: 2047,
    ErrorMessage: "Устройство заморожено пользователем",
    Description: "Устройство заморожено.",
    Solution: "Проверьте, не заморозил ли пользователь устройство.",
  },
  errorCode_2050: {
    ErrorCode: 2050,
    ErrorMessage: "ИК-код для клавиши не существует",
    Description: "Инфракрасный (ИК) код не существует.",
    Solution:
      "Проверьте, существует ли инфракрасный код или правильно ли значение параметра.",
  },
  errorCode_2051: {
    ErrorCode: 2051,
    ErrorMessage: "Не удалось отправить ИК-команду",
    Description: "Не удалось отправить инфракрасную команду.",
    Solution:
      "Проверьте команду. Повторите попытку позже или обратитесь к администратору.",
  },
  errorCode_2052: {
    ErrorCode: 2052,
    ErrorMessage: "Установка конкретной температуры не поддерживается",
    Description:
      "Команда установки определенной температуры не поддерживается.",
    Solution:
      "Установите допустимую команду на основе параметров запроса в документации API.",
  },
  errorCode_2053: {
    ErrorCode: 2053,
    ErrorMessage: "Соответствующий ИК-код недействителен",
    Description: "Указанный инфракрасный код недействителен.",
    Solution:
      "Проверьте статус инфракрасного кода или правильно ли значение параметра.",
  },
  errorCode_2054: {
    ErrorCode: 2054,
    ErrorMessage: "Подчиненное устройство не существует",
    Description: "Подчиненное (sub-device) устройство не существует.",
    Solution:
      "Проверьте, существует ли подчиненное устройство или правильно ли значение параметра.",
  },
  errorCode_2055: {
    ErrorCode: 2055,
    ErrorMessage: "Устройство не поддерживается",
    Description: "Устройство не поддерживается.",
    Solution:
      "Установите поддерживаемое устройство на основе параметров запроса в документации API.",
  },
  errorCode_2056: {
    ErrorCode: 2056,
    ErrorMessage: "Устройство привязано или неактивно",
    Description: "Устройство уже привязано или неактивно.",
    Solution:
      "Проверьте статус устройства или правильно ли значение параметра.",
  },
  errorCode_2060: {
    ErrorCode: 2060,
    ErrorMessage: "Не удалось добавить пользователя",
    Description: "Не удалось добавить пользователя.",
    Solution: "Повторите попытку позже или обратитесь к администратору.",
  },
  errorCode_2061: {
    ErrorCode: 2061,
    ErrorMessage: "Конфигурация пуш-уведомлений не задана",
    Description: "Настройки пуш-уведомлений не заданы.",
    Solution: "Настройте функцию пуш-уведомлений.",
  },
  errorCode_2062: {
    ErrorCode: 2062,
    ErrorMessage: "Данные уже существуют",
    Description: "Данные уже существуют.",
    Solution:
      "Проверьте, существуют ли уже эти данные. Не повторяйте операцию.",
  },
  errorCode_2063: {
    ErrorCode: 2063,
    ErrorMessage: "Другое устройство Zigbee обновляется",
    Description: "В данный момент обновляется другое устройство Zigbee.",
    Solution:
      "Проверьте, обновляется ли устройство Zigbee, или повторите попытку позже.",
  },
  errorCode_2064: {
    ErrorCode: 2064,
    ErrorMessage: "Версия устройства самая последняя",
    Description: "Версия встроенного ПО устройства является самой последней.",
    Solution: "Сравните номера версий.",
  },
  errorCode_2101: {
    ErrorCode: 2101,
    ErrorMessage: "Дублирование имен устройств",
    Description: "Дублирование имен устройств.",
    Solution: "Проверьте, существует ли уже устройство с таким именем.",
  },
  errorCode_2401: {
    ErrorCode: 2401,
    ErrorMessage: "Неверное имя пользователя или пароль",
    Description:
      "Неверное имя пользователя или пароль учетной записи приложения.",
    Solution: "Измените аккаунт или пароль и повторите попытку.",
  },
  errorCode_40000001: {
    ErrorCode: 40000001,
    ErrorMessage: "Свойство пустое",
    Description: "Свойство не может быть пустым.",
    Solution: "Проверьте, не отсутствует ли свойство или не задано ли оно.",
  },
  errorCode_40000002: {
    ErrorCode: 40000002,
    ErrorMessage: "Недопустимое кастомное имя",
    Description: "Имя пустое или содержит эмодзи.",
    Solution: "Проверьте, не отсутствует ли имя или не задано ли оно.",
  },
  errorCode_40000003: {
    ErrorCode: 40000003,
    ErrorMessage: "Код функции не существует",
    Description:
      "Продукт, к которому принадлежит устройство, не определяет это значение функции.",
    Solution:
      "Проверьте значение этой функции или просмотрите определение функций продукта на платформе Tuya Developer Platform.",
  },
  errorCode_40000200: {
    ErrorCode: 40000200,
    ErrorMessage: "Системная ошибка",
    Description: "Обратитесь к администратору.",
    Solution:
      "Повторите попытку позже. Если проблема повторится, отправьте тикет в службу поддержки.",
  },
  errorCode_40000203: {
    ErrorCode: 40000203,
    ErrorMessage: "Недопустимый параметр",
    Description: "См. документацию по API и задайте параметры.",
    Solution:
      "Установите допустимый тип параметра и диапазон значений на основе параметров запроса в документации API.",
  },
  errorCode_40000232: {
    ErrorCode: 40000232,
    ErrorMessage: "Устройство Zigbee обновляется",
    Description: "Проверьте, обновляется ли устройство Zigbee под шлюзом.",
    Solution:
      "Повторите попытку позже. Если проблема повторится, отправьте тикет в службу поддержки.",
  },
  errorCode_40000233: {
    ErrorCode: 40000233,
    ErrorMessage: "Система обновлена до последней версии",
    Description: "В системе уже запущена последняя версия.",
    Solution: "Сравните номер версии или повторите попытку позже.",
  },
  errorCode_40000247: {
    ErrorCode: 40000247,
    ErrorMessage: "Модуль устройства не существует",
    Description: "Проверьте информацию о модуле.",
    Solution:
      "Проверьте, передало ли устройство информацию о модуле при его активации.",
  },
  errorCode_40000302: {
    ErrorCode: 40000302,
    ErrorMessage: "Сбой вызова удаленного API",
    Description: "Обратитесь к администратору.",
    Solution:
      "Повторите попытку позже. Если проблема повторится, отправьте тикет в службу поддержки.",
  },
  errorCode_40000303: {
    ErrorCode: 40000303,
    ErrorMessage: "Недопустимый параметр",
    Description: "См. документацию по API и задайте параметры.",
    Solution:
      "Установите допустимый тип параметра и диапазон значений на основе параметров запроса в документации API.",
  },
  errorCode_40000308: {
    ErrorCode: 40000308,
    ErrorMessage: "Неверный формат команды или значения",
    Description: "См. документацию по API и задайте параметры.",
    Solution:
      "Установите допустимый тип параметра и диапазон значений на основе параметров запроса в документации API.",
  },
  errorCode_40000801: {
    ErrorCode: 40000801,
    ErrorMessage: "Устройство не в сети",
    Description: "Проверьте статус устройства.",
    Solution: "Проверьте статус подключения и источник питания.",
  },
  errorCode_40000802: {
    ErrorCode: 40000802,
    ErrorMessage: "Ошибка свойства",
    Description: "Проверьте свойство устройства.",
    Solution: "Проверьте, правильно ли задано свойство устройства.",
  },
  errorCode_40000901: {
    ErrorCode: 40000901,
    ErrorMessage: "Устройство не существует",
    Description: "Проверьте параметры запроса.",
    Solution: "Проверьте значение параметра запроса.",
  },
  errorCode_40000903: {
    ErrorCode: 40000903,
    ErrorMessage: "Недопустимый параметр",
    Description: "См. документацию по API и задайте параметры.",
    Solution:
      "Установите допустимый тип параметра и диапазон значений на основе параметров запроса в документации API.",
  },
  errorCode_40000904: {
    ErrorCode: 40000904,
    ErrorMessage: "Слишком много параметров",
    Description: "См. документацию по API и задайте параметры.",
    Solution:
      "Установите соответствующее количество параметров на основе параметров запроса в документации API.",
  },
  errorCode_40000999: {
    ErrorCode: 40000999,
    ErrorMessage: "Системная ошибка устройства",
    Description: "Обратитесь к администратору.",
    Solution:
      "Повторите попытку позже. Если проблема повторится, отправьте тикет в службу поддержки.",
  },
  errorCode_40001001: {
    ErrorCode: 40001001,
    ErrorMessage: "ID пространства пуст",
    Description: "Проверьте параметры запроса.",
    Solution:
      "Проверьте, не отсутствует ли ID пространства или не задан ли он.",
  },
  errorCode_40001002: {
    ErrorCode: 40001002,
    ErrorMessage: "Недопустимый ID родительского пространства",
    Description: "Проверьте значение parent_space_id.",
    Solution:
      "Проверьте, не отсутствует ли parent_space_id или не задан ли он неправильно.",
  },
  errorCode_40001003: {
    ErrorCode: 40001003,
    ErrorMessage: "Название пространства пустое",
    Description: "Проверьте параметры запроса.",
    Solution:
      "Проверьте, не отсутствует ли параметр названия пространства или не задан ли он.",
  },
  errorCode_40001004: {
    ErrorCode: 40001004,
    ErrorMessage: "Название пространства слишком длинное",
    Description: "Название пространства может содержать до 50 символов.",
    Solution:
      "Установите допустимый тип параметра и диапазон значений на основе параметров запроса в документации API.",
  },
  errorCode_40001005: {
    ErrorCode: 40001005,
    ErrorMessage: "Описание пространства слишком длинное",
    Description: "Описание пространства может содержать до 255 символов.",
    Solution:
      "Установите допустимый тип параметра и диапазон значений на основе параметров запроса в документации API.",
  },
  errorCode_40001101: {
    ErrorCode: 40001101,
    ErrorMessage: "ID ресурса пуст",
    Description: "Проверьте параметры запроса.",
    Solution: "Проверьте, не отсутствует ли ID ресурса или не задан ли он.",
  },
  errorCode_40001102: {
    ErrorCode: 40001102,
    ErrorMessage: "Набор ресурсов превышает лимит",
    Description: "Набор ресурсов превышает ограничение по длине.",
    Solution:
      "Установите соответствующее количество наборов ресурсов на основе параметров запроса в документации API.",
  },
  errorCode_40001103: {
    ErrorCode: 40001103,
    ErrorMessage: "Недопустимый тип ресурса",
    Description: "Проверьте параметры запроса.",
    Solution:
      "Установите допустимое значение параметра на основе параметров запроса в документации API.",
  },
  errorCode_40001104: {
    ErrorCode: 40001104,
    ErrorMessage: "Ресурс не существует",
    Description: "Проверьте параметры запроса.",
    Solution:
      "Проверьте, не отсутствует ли параметр или не задан ли он неправильно.",
  },
  errorCode_40001105: {
    ErrorCode: 40001105,
    ErrorMessage: "Ресурс уже существует в этом пространстве",
    Description: "Проверьте параметры запроса.",
    Solution: "Проверьте, существует ли уже этот ресурс.",
  },
  errorCode_40001106: {
    ErrorCode: 40001106,
    ErrorMessage: "В этом пространстве существует подпространство",
    Description: "Удалите подпространство перед продолжением.",
    Solution: "Сначала удалите подпространство.",
  },
  errorCode_40001107: {
    ErrorCode: 40001107,
    ErrorMessage: "В этом пространстве существует ресурс",
    Description: "Удалите ресурс и повторите попытку.",
    Solution: "Удалите существующий ресурс в этом пространстве.",
  },
  errorCode_40001900: {
    ErrorCode: 40001900,
    ErrorMessage: "Нет прав на пространство",
    Description: "Нет прав для доступа к этому пространству.",
    Solution: "Предоставьте права доступа для этого пространства.",
  },
  errorCode_40001901: {
    ErrorCode: 40001901,
    ErrorMessage: "Пространство не существует",
    Description: "Пространство не существует.",
    Solution:
      "Проверьте, не отсутствует ли параметр или не задан ли он неправильно.",
  },
  errorCode_40001902: {
    ErrorCode: 40001902,
    ErrorMessage: "Недопустимый параметр",
    Description: "Проверьте параметр и повторите попытку.",
    Solution:
      "Установите допустимый тип параметра и диапазон значений на основе параметров запроса в документации API.",
  },
  errorCode_40002901: {
    ErrorCode: 40002901,
    ErrorMessage: "Группа не существует",
    Description:
      "Группа не существует. Проверьте, действительна ли эта группа.",
    Solution:
      "Проверьте, не отсутствует ли параметр или не задан ли он неправильно.",
  },
  errorCode_40002902: {
    ErrorCode: 40002902,
    ErrorMessage: "uid не существует",
    Description: "ID группы uid не существует. Проверьте параметр.",
    Solution: "Проверьте значение параметра uid.",
  },
  errorCode_40002903: {
    ErrorCode: 40002903,
    ErrorMessage: "Превышен верхний лимит",
    Description:
      "Количество групп в этом пространстве или устройств в группе превышает лимит.",
    Solution: "Проверьте ограничения для этого пространства.",
  },
  errorCode_40002904: {
    ErrorCode: 40002904,
    ErrorMessage: "Нет прав на эту группу",
    Description: "Нет прав на доступ к этой группе.",
    Solution:
      "Проверьте, есть ли у учетной записи права на доступ к этой группе.",
  },
  errorCode_40002905: {
    ErrorCode: 40002905,
    ErrorMessage: "Группа не разрешена",
    Description: "Этот продукт не поддерживает создание групп.",
    Solution: "Настройте продукт так, чтобы он поддерживал создание групп.",
  },
  errorCode_40002906: {
    ErrorCode: 40002906,
    ErrorMessage: "Недопустимый параметр",
    Description: "Проверьте параметр.",
    Solution:
      "Установите допустимый тип параметра и диапазон значений на основе параметров запроса в документации API.",
  },
  errorCode_40002999: {
    ErrorCode: 40002999,
    ErrorMessage: "Ошибка сервиса групп",
    Description: "Произошла ошибка сервиса групп. Обратитесь к администратору.",
    Solution:
      "Повторите попытку позже. Если проблема повторится, отправьте тикет в службу поддержки.",
  },
  errorCode_40003900: {
    ErrorCode: 40003900,
    ErrorMessage: "Параметр пуст",
    Description:
      "Заполните обязательный параметр на основе документации разработчика.",
    Solution:
      "Проверьте, не отсутствует ли параметр или не задан ли он, на основе параметров запроса в документации API.",
  },
  errorCode_40003901: {
    ErrorCode: 40003901,
    ErrorMessage: "Недопустимый параметр",
    Description: "Заполните параметр допустимым значением.",
    Solution:
      "Установите допустимый тип параметра и диапазон значений на основе параметров запроса в документации API.",
  },
  errorCode_40003902: {
    ErrorCode: 40003902,
    ErrorMessage:
      "Не удалось включить/выключить сценарий автоматизации (linkage scene)",
    Description: "Проверьте ID правила сценария.",
    Solution: "Проверьте, включен ли ID правила сценария в параметр запроса.",
  },
  errorCode_40003903: {
    ErrorCode: 40003903,
    ErrorMessage: "Параметр пуст",
    Description:
      "Заполните обязательный параметр на основе документации разработчика.",
    Solution:
      "Установите допустимый тип параметра и диапазон значений на основе параметров запроса в документации API.",
  },
  errorCode_40003904: {
    ErrorCode: 40003904,
    ErrorMessage: "Правило автоматизации не существует",
    Description: "Проверьте параметры запроса.",
    Solution:
      "Проверьте, не отсутствует ли параметр запроса или не задан ли он неправильно.",
  },
  errorCode_40003905: {
    ErrorCode: 40003905,
    ErrorMessage: "Дублирование ID условий для правила автоматизации",
    Description: "Проверьте параметры запроса.",
    Solution:
      "Установите допустимый тип параметра и диапазон значений на основе параметров запроса в документации API.",
  },
  errorCode_40004001: {
    ErrorCode: 40004001,
    ErrorMessage: "Недопустимый параметр",
    Description:
      "Заполните обязательный параметр на основе документации разработчика.",
    Solution:
      "Установите допустимый тип параметра и диапазон значений на основе параметров запроса в документации API.",
  },
  errorCode_40004002: {
    ErrorCode: 40004002,
    ErrorMessage: "Команда (инструкция) не существует",
    Description:
      "Заполните обязательный параметр на основе документации разработчика.",
    Solution:
      "Проверьте, не отсутствует ли параметр инструкции или не задан ли он неправильно.",
  },
  errorCode_60009001: {
    ErrorCode: 60009001,
    ErrorMessage: "Отсутствует в пакете прав",
    Description:
      "Этот API отсутствует в пакете прав (permission package), поддерживаемом связанной авторизацией.",
    Solution:
      "Обратитесь к документации пакета прав, чтобы выбрать подходящий API.",
  },
};
